from telegram import Update
from telegram.ext import ContextTypes

async def about(update: Update, context: ContextTypes.DEFAULT_TYPE):
    message = """
╔═══════════════════✦❘༻༺❘✦═══════════════════╗
                 🚀 QazSpace ҚОСЫМШАСЫ 🚀
╚═══════════════════✦❘༻༺❘✦═══════════════════╝

📘 Бұл қосымша ағылшын тілін қазақша арқылы  
    оңай әрі шабытпен үйрену үшін жасалған.

━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

👨‍💻 ШЫҒАРУШЫ:   『SA_Corporation』
👩‍🏫 ҚОЛДАУ:      『Start English course』  
         — * Білім әлеміне жол ашатын курс*

━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

🎯  МАҚСАТ:  
Әрбір жас білімге жол ашып,  
арманын жүзеге асыру үшін ұмтылсын!  
Өзіне сенсін. Болашағына сенсін.

━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

✨  ҰРАН:  
「Start English course — Start a new life!
Білім – болашақтың кілті. Ал сен – сол болашақтың иесісің!

━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
"""
    await update.message.reply_text(message)
