from telegram import Update
from telegram.ext import ContextTypes

async def help_command(update: Update, context: ContextTypes.DEFAULT_TYPE):
    text = """
╔📚 *QazSpace Көмек* 📚╗

👋 Қош келдің, білім іздеуші!
Бұл қосымшада сен:
🔹 Ағылшын тілін қазақша арқылы оңай үйренесің  
🔹 Шабыт аласың  
🔹 Арманыңдағы болашаққа қадам басасың!

━━━━━━━━━━━━━━━━━

🛠️ *Қолжетімді командалар:*

🌟 *Жалпы командалар:*
🚀 /start – Қосымшамен танысуды бастау  
🧾 /about – Қосымша жайлы толық ақпарат  
🆘 /help – Осы көмек мәзірі  
🆔 /myid – Telegram ID-ді білу  

🌐 *Ағылшын тілі командалары:*
📖 /word – Кездейсоқ сөзді үйрену  
📊 /set_words – Күніне сөз жаттау жоспарын орнату  
🔄 /translate – Аударма жасау (EN ↔ KZ)  

━━━━━━━━━━━━━━━━━━━

💡 *Кеңес:*  
Әр команда — бір жаңа мүмкіндік.  
Күнде 1 қадам жаса — болашақта 1000 еселенген нәтиже болмақ.

Бүгінгі кішкентай қадам —  
ертеңгі үлкен жетістіктің бастауы!

╚═══════════════════╝
"""
    await update.message.reply_text(text, parse_mode="Markdown")
